---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Analysis.RouteAnalysisSettings
source: html/d35fb9d7-7316-a8af-2905-847921d5b7ef.htm
---
# RouteAnalysisSettings Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.